{
  "tasks": [
    {
      "title": "Day 1",
      "what": "Get your picture taken and order your business cards.  Title companies offer this for free or at discounted rates for agents from time to time.Contact a couple title companies and ask them if they have any “head shot” photography sessions coming up. If you are unable to find a free or discounted session, find a reputable photographer that can shoot and edit a few pictures for you.",
      "why": " You’ll be using your picture/profile for social media, business cards, post cards, fliers, your website, your Brokerage’s profile page, etc. ",
      "results": "People need to know who you are and who they are going to be meeting.  Take the time to have a crisp, clean, and professional picture taken that shows you care about your image.  Customers will be more likely to refer you and hold onto your business card and marketing materials if they are professional and have a good appearance."
    },
    {
      "title": "Day 2",
      "what": "Dress for success.  If you don’t have at least 5-6 professional outfits, go shopping and find a few.  Crisp/casual should be your approach.  For me here in Arizona, that is a collared shirt, slacks and dress shoes.  Inviting, approachable, and well presented is how you need to look each day.",
      "why": "If you look professional, you’ll feel professional, you’ll act professional, and the first impression you’ll have on prospective clients will be “professional”.  By presenting yourself in this manor, you’ll be inspired, confident, and in a position to “work” when the time comes.  Even when working from home on days you don’t have appointments, dress like you are going to the office or meeting with clients.  You have to create the confidence and expectation (first thing in the morning) that you will be meeting with someone each day and building that confidence in yourself begins as soon as your day starts.",
      "results": "Potential clients and prospects will notice your appearance.  If they see you care about yourself and how you look, they will be more apt to believe you take care of your business in the same manor (professional, calculated, and well planned)"
    },
    {
      "title": "Day 3",
      "what": "Meet with 3 marketing reps from local title companies.",
      "why": "Title companies want to earn your business and one of the things they will do for you is assist in putting together marketing materials for you at no cost.  They will have tons of marketing ideas.  Listen.  Try some of their ideas, and figure out what they can do to help you grow your business and impress the buyers and sellers you’ll be working with.",
      "results": "Meet one of their escrow offers.  A good escrow officer will make your life easier.  Try to meet a couple Escrow Oficers and find one you like.  Your goal is to walk away from these meetings with marketing reps with several new ideas on how to market “YOURSELF”.  Marketing homes for sale is easy.  Your goal with any advertising you do is to market YOURSELF, your services, and how YOU can help someone with their real estate needs. "
    },
    {
      "title": "Day 4",
      "what": "Create a flier/bio about yourself.  Who are you?  Why are you in Real Estate?  Where did you go to school, graduate from college, work before you got into real estate?  Where do you volunteer?  What non-profit organizations do you support?  What are the goals you have for people who hire you?",
      "why": "Having a professional flier will be a nice supplement or addition to your business card and it will set yourself apart from other practitioners.  You want to become tangible or relatable with the people you come into contact with.  If consumers know a little bit about you, they may have similar interests or view you as less threating to approach and talk with.",
      "results": "Ultimately, you want the person you give your flier to, to contact you when it is time for them to buy or sell a home.  You are also providing the flier to them and asking them to give it to a friend, family member or co-worker that may be considering buying or selling a home."
    },
    {
      "title": "Day 5",
      "what": "Create your “Sphere of Influence”.  Create a list of people you know that you can call right now, and they will know exactly who you are.",
      "why": "This group of people knows you, most likely trust you, and will help you if they can by referring you to someone they know.  Most importantly they will trust you to list and sell their home when the time is right.",
      "results": "The “Sphere of Influence” you begin building will be the most influential group of people that will help you grow your business!  They will refer you to their friends, call you when they have a real estate question, and call you when they are ready to buy or list their home for sale.  It’s important to stay in touch with these people multiple times a year through personal phone calls, visits, emails, and mailings.  You need to stay in front of this group and they need to know you’re successful and helping others with their Real Estate needs.  Every time they see a for sale sign, hear something about Real Estate on the news, have a question about the market or hear a friend talking about Real Estate you want them to think about “YOU”."
    },
    {
      "title": "Day 6",
      "what": "Mail a personal letter to your Sphere of Influence or hand deliver it to them at work or at home.  Make this list comfortable but as large as you can.  I like to have people on my list that I can call and say “hey this is Troy” and they know exactly who I am.",
      "why": "People need to know you’re in real estate now and that you’re ready to help them and their friends and family with anything real estate related.",
      "results": "You want people to refer you to others and of course call you when they need a realtor and your services.  Its human nature to want to help others especially people you like and people that like you.  The people on this list want to see you become successful and they want to help you.  Lean on them as much as you can and be sure to let them know you appreciate them."
    },
    {
      "title": "Day 7",
      "what": "Call three successful realtors at your brokerage and offer to buy them lunch or meet with them at their office.",
      "why": "You want referrals from them and you want to pick their brain to put more ideas together.  Experienced agents will help you “weed out” ideas and marketing plans that don’t work.  Ask them how they generate leads and where their business comes from.",
      "results": "When you meet with someone that has been in the business for a while, they come across deals and phone calls they don’t want to work.  You want them to refer these people to you.  Offer to pay them a 25% referral fee (standard referral fee) on any deal they send you.  Let them know you’re hungry and that you want the business.  When they send you something, be sure to give that client the best service you can possibly give and make sure you follow up with the realtor that sent you the deal.  Even have the client you worked with call that realtor and thank them for putting them in touch with you because they are so happy with your services."
    },
    {
      "title": "Day 8",
      "what": "Create your own personal website.  I know this sounds expensive.  It’s not.  Most brokerages will offer a free (or very low cost) website for their new agents.  Take advantage of it!  If your brokerage doesn’t offer this, seek out a local title company or a local lender for low cost ideas on how to put one together.  *Quick tip to remember and I’ll mention this a lot through this 30 day program; title companies and lenders want you to refer business to them and they are going to help you as much as they can.  Lean on them for assistance as you move forward in your career.* Most local MLS rules will allow you to advertise any listings within your own brokerage.  Ask a realtor from your office if you can advertise their listings on your website.",
      "why": "Why you should do this: Over 95% of home buyers and sellers research the buying and selling process online before they purchase or sell a property.  You need to have a presence of some sort online.  Your personal website will grow with your business and continue getting better.  For now, just make sure you have a webpage so people can find you online when they Google search your name.  By having a webpage you’ll become more tangible to the consumer.",
      "results": "Simply; a presence online.  Just a very simple website that has your picture, a brief explanation of who you are, a few listings, and a few simple helpful links for consumers who look you up.  SEO (search engine optimization), pay per click, and other lead generation programs are big business and you’re going to be “told” you need to invest in driving traffic to your site by large marketing firms.  Right now you’re not ready for this kind of expense or “grooming” of potential clients that will come to you through online leads.  Your goal in creating your first website is to just simply have a presence on line so consumers can see who you are."
    },
    {
      "title": "Day 9",
      "what": "Post about your new profession on your Facebook, Twitter, Instagram, Google +, Linkedin and any other social or professional network page you’re involved with.  ",
      "why": "Why you should do this: Be careful about this though as most of your friends don’t want real estate crammed down their throat every time you post something.  However, they do need to know you are now a realtor and you’re looking for clients and business.  Posting something once or twice a month about real estate seems to be an appropriate number.",
      "results": "Hopefully a lot of “likes” and support from your friends and people you know.  Eventually your postings and messages will turn into leads and referrals from people you know."
    },
    {
      "title": "Day 10",
      "what": "Call every person you mailed your business card and flier to.  Make sure they’ve received it and ask them if they know of anyone looking to buy or sell a home.",
      "why": "Why you should do this:  You want to make sure they know you are in real estate now and you also want them to start referring you.",
      "results": "Everyone needs to know you are now a real estate professional and that they can contact you anytime to assist them with any real estate need and refer their friends and family to you."
    },
    {
      "title": "Day 11",
      "what": "Contact your old boss or boss’s from previous professions or jobs.  Hopefully, you left on a good note and have a good relationship with your previous boss and co-workers.  Schedule a day and time to bring doughnuts, jamba juice, pizza, starbucks, lunch, etc. to the break room and meet with some of your previous co-workers.  If you don’t feel comfortable doing this with one of your previous places of employment, seek out the help of your spouse or a good friend and see it you can visit their place of business and do the same thing.",
      "why": "These people are easy to talk to and will hopefully be supportive of your new profession.",
      "results": "Ideally, one of your previous co-workers or bosses is looking to make a move and will feel comfortable working with you.  If not maybe they have a friend who is looking to buy or sell a home and they can refer you to them.  Do your best to ask everyone for their contact information so you can provide a market analysis for them and keep them up to date with the real estate market.  Remember, everyone likes to talk about real estate.  It’s interesting and you are the expert!"
    },
    {
      "title": "Day 12",
      "what": "Contact three small business owners and offer to place an ad in your upcoming real estate newsletter for free.  Examples would be: your favorite restaurant, nail salon, dry cleaners, construction company, landscaping service, carpet cleaner, local boutique shops, specialty stores, etc.",
      "why": "Small business owners know how much hard work it takes to run a successful business and they most likely have had help in getting their business off the ground.  A successful small business owner is always looking for a way to bring in more business, sell more products, or generate more revenue.  By offering to help them in someway, they will offer to refer your name to clients and friends of theirs the next time “Real Estate” finds its way into one of their conversations.",
      "results": "Your goal is to create another contact and also advertise your real estate newsletter to their customers.  You can do this by putting it on the counter top at their place of business or give them a handful of your newsletters with their “free” ad and ask them to distribute it to their customers for you."
    },
    {
      "title": "Day 13",
      "what": "Call one of the following four people (or call all four) in your community (Insurance agent, Financial planner, Attorney, CPA) and take them to lunch.",
      "why": "People in these professions have very large books of business and they know a lot of people.  They also talk with a lot of people every day and have built there business the same way you will be building yours.  Let them know who you are and ask them how you can help them.  A lot of times an attorney needs comps on home values of his or her clients.  Insurance agents will like to work with you to reciprocate clients, and the same thing with financial planners.  Offer to help them in some way and do your best to gain their trust.  Ask them about their business, what they specialize in and how you can become some type of a partner with them.  Remember, these people want to help you and if you are sincere they will give you as much assistance as they have time for.",
      "results": "Expect to schedule an appointment with one of these people and create a contact that can help you grow your referral business."
    },
    {
      "title": "Day 14",
      "what": "Go to your local bank where you do business and also visit 3 or 4 other big banks around your area.  Ask to meet with their mortgage lender.  Tell them about yourself and let them know you are interested in creating a “give and take relationship” with them.  As you generate buyer leads, let them know you’d like to refer them to be pre-qualified.  Give them one of your personal fliers and business cards and stop back in to see them every couple months to see how you can help each other.",
      "why": "Before a person can purchase a home, they need to qualify for one.  Every large bank in America has an in-house mortgage lender that will pre-qualify their walk-in customers. Customers regularly walk into the bank and ask to be pre-qualified for a home purchase.  You want to be the real estate professional that is referred by that mortgage lender every single time they prequalify a customer.",
      "results": "Referrals from a mortgage lender.  You also hope to create another professional contact that is in front of a lot of people each day.  As you generate buyer leads refer them to these people to help establish the relationship."
    },
    {
      "title": "Day 15",
      "what": "Visit 4 or 5 model home subdivisions in your area.  Talk to the sales reps and ask them if they have buyers coming in that need to sell their homes.",
      "why": "Learn about the incentives they offer to buyers, lot premiums, how many homes they are selling in a week/month.  Try to get as much information from them as you can and get them on your “Team”.  It’s important to have relationships with builders and new homes sales representatives.  When you have buyers looking for new homes, call the sales reps you’ve met and ask them when they are working so you can personally bring your buyers by to meet them.",
      "results": "You want to build a referral network with local sales reps in your community.  Most of the time the buyers they are entertaining and trying to sell homes to need to sell their homes first.  As a new home sales representative they can’t work the re-sale market.  They need a competent real estate professional to refer sellers to.  You want to be that person."
    },
    {
      "title": "Day 16",
      "what": "Schedule an open house.  Contact a local realtor in your brokerage that has a nice listing in a neighborhood you’re familiar with and ask them if you can hold their home open.",
      "why": "Doing an open house will put you in front of people and give you an opportunity to practice talking about real estate in a non threatening atmosphere.  You will learn how to approach people and win them over.  You’ll make mistakes and sometimes feel awkward but being able to confidently speak about real estate and “the market” is something you’ll need to do well.  Talking with a bunch of strangers that walk through the home will help you succeed and fail repetitively.  Remember the successful conversations you have and learn from your mistakes.",
      "results": "Anytime you sit an open house, your goal is never to sell the home you have open.  You are there to meet people and create trust between you and anyone that comes in the door.  Give them a bunch of free information about the neighborhood, recent sales and other homes for sale in the area.  Your job is to demonstrate your knowledge of the area, not just the home you have open.  You’ll most likely run into a few “nosey neighbors”.  If you talk with them a little, you’ll find out they are being “nosey” for a reason.  They may be considering selling their home in the next few months and they are out scouting other homes and trying to meet a realtor that they trust and that works hard.  Try to get a name, email, phone number or address of everyone that comes in so you can add them to your list of contacts and stay in touch with them over the next few months.  If they are legitimately looking for a home to buy, give them a list of all the other homes for sale in the neighborhood and offer to show them anything they’d like to see."
    },
    {
      "title": "Day 17",
      "what": "Start creating a list of people you know who you can refer business to.  Examples would be: Handyman services, carpet cleaners, painters, building contractors, electricians, plumbers, home audio equipment installers, home security companies, landscapers, pool cleaners, exterminators, tree trimmers, house cleaners, appraisers, lenders, etc.",
      "why": "Clients and customers will ask you for referrals for these types of services when you are working with them.  Be sure you only refer competent professionals.  Sending a poor referral will backfire on you and leave a bad taste in the mouths of your clients.",
      "results": "Take the list you’ve created and contact every person on your list.  Let them know you are in real estate and that you want to refer them when clients need their services.  Ask them if that is O.K. and if they will also be comfortable referring you.  Meet with every single person that says “yes” and get a stack of their business cards.  Make sure they have a stack of yours well.  Create a flier with all of the people you can confidently refer and pass it out to everyone on the list and also to your clients and people you meet.  Make sure you tell everyone you give a flier to, to reference your name anytime they contact someone on the list."
    },
    {
      "title": "Day 18",
      "what": "Do a market analysis for all your friends, family, and people in your sphere of influence.  U.S. mail it to them with a hand written note.  Home values are free on many websites now however, they are not always accurate and when a person is truly ready to sell their home, they need the assistance of a professional like you that can identify the true value of their home identifying all of their upgrades and overall care for their property.",
      "why": "Everyone is interested in Real Estate especially if they own a property or multiple properties.  Provide the market analysis to them for free and follow up with them a week or so after you mail it to them.  Ask them if they enjoyed receiving your free information about their home and if they own any other properties they would like a free analysis on.  Also, ask them if they know of anyone else who would benefit from this information.",
      "results": ""
    },
    {
      "title": "Day 19",
      "what": "Work with the 80% of the people in this world that want and need your help.  80% of our population are good people and will become good clients for you.  They want and need your help and will be respectful to you and your time.  You want to work with these people and they are easily identifiable.  10% of the people out there don’t want your help and don’t need your help.  Don’t spend a lot of time trying to convince them what you can do for them.  Let them do their research and do things on their own.  The other 10% of the people out there are psychos…..seriously, they are psychos.  These people will cause problems for you, they’ll waste your time, they’ll make ignorant demands and requests and are not worth working for regardless of what they intend on selling or buying.  Focus on the clients and customers who really need you and value everything you have to offer.",
      "why": "It’s obvious.  You want to get back what you put into your business and working with customers who respect you, your time, and your ability to help them will become your customers for life.  Spend the most time with these people and always let them know you care about them.",
      "results": "A healthy business that will continue producing for you year after year with good clients and customers that respect the hard work and effort you provide for them."
    },
    {
      "title": "Day 20",
      "what": " “Shake hands and kiss babies”!  In other words, talk to people about real estate and try to strike up conversations with people you come in contact with daily.  Compliment them in one way or another.  Or notice something special about who they are and tell them about it.  The book “How to Win Friends and Influence People” is a success for a reason.  The more relationships you build with people in your community, the easier it will be to transition those relationships in to business transactions.  I know this sounds silly but you really do need to be meeting people and one easy way to do that is by complementing people and striking up a conversation.  You should be doing this every chance you get (at parties, with friends, or standing in line at a movie or waiting to be seated at dinner).  Any chance you get, do your best to steer every conversation you have towards real estate.",
      "why": "You’ll find that as soon as anyone knows you’re a realtor, they will want to talk about the market with you or tell you a story about market, or think they are experts on the market.  You’ll gain confidence and create business for yourself with every opportunity you have to bring real estate into your conversation.  By being friendly, polite, curious, and genuinely interested in people you meet will give you an upper hand in creating a friendship and hopefully establishing a new client.",
      "results": "Talking about real estate will help you stay in “Realtor Mode”.  One of the greatest advantages with your new profession is that you always have the opportunity to be working and making contacts.  The very second you open your front door and walk outside; the entire world is your workplace.  Look around you.  How many homes are on your block, in your subdivision, around your town, throughout your city, and all over your state?  You have an opportunity to meet the owners of these properties and 80% of their owners need and want your assistance."
    },
    {
      "title": "Day 21",
      "what": "Pick a subdivision in your area that you know a lot about or pick a subdivision where you know several people who live in the community.  Start researching the subdivision.  Find out how many homes are for sale and find out how long it takes the average home to sell in the subdivision and at what price points.  Try and figure out if there is a local agent that sells a lot of properties in the community.  If there is one, move on to another subdivision and find a community that is not dominated by one particular agent.",
      "why": "This neighborhood will eventually become your “Farm”.  Make sure the subdivision isn’t larger than 200 homes.  It becomes expensive to farm a community larger than 200 total properties and the smaller a subdivision, the easier it is to become an “expert” within the community.",
      "results": "Your goal is to ultimately list and a sell a lot of homes in this community.  Meeting and helping people in the neighborhood will give you the upper hand in listing properties for homeowners in the area as they become more familiar with you throughout the year.  Over the course of the next few days, go look at available homes in the community and read through a copy of the community’s HOA rules and regulations and local CC&R’s.  Your goal right now is just to become familiar with the subdivision."
    },
    {
      "title": "Day 22",
      "what": "Create a marketing plan for listing, marketing, and selling homes.  You’ll be surprised how many (even seasoned realtors) don’t have a defined marketing plan that they can hand over to prospective sellers.  This will be a work in progress for you to develop a marketing plan that will produce results and one that will impress the majority of sellers you meet with.  However, there is no better time than now to start putting a marketing strategy together.  Start on-line and surf through as many local realtor websites you can find and try to identify what other realtors are doing to market their properties.  Use some of the ideas you come across, add in some of your own and talk with your title representative about the countless (free to you) marketing ideas they have access to.  Put these ideas on paper and make sure you can explain each part of your marketing plan to prospective sellers.",
      "why": "Sellers want to know why they are paying 6% of the selling price of their home to one or two realtors.  In most cases, this is a lot of equity they have earned through the years and now have to give up to hire you.  You need to be able to justify your worth to them.  Show them how hard you plan on working to sell their home and bring them the highest net offer the market will procure.  You will also be learning where to put your marketing dollars.  You’ll find out quickly that most of the marketing you’ll be doing will be to promote “you” and not necessarily the home you have for sale.  However, sellers like to see their home advertised in as many places as possible.  It’s up to you to make sure they know where their home will be advertised and how many people are looking at it each day.",
      "results": "By creating a marketing plan you can hand over to a prospective seller, you are establishing the accountability of your services to them.  Only identify marketing strategies in your marketing plan that you intend to follow through with and can demonstrate (to the seller) that they are being implemented."
    },
    {
      "title": "Day 23",
      "what": "If you have a listing, put it on a realtor home tour.  If you don’t have a listing, seek out a realtor in your office and offer to place one of their listings on a local realtor home tour.",
      "why": "Realtor home tours are tours designed to take 10-12 realtors through 10-12 homes over about a three hour period.  Realtors are given feedback sheets for every listing they enter and the idea is to provide feedback to the sellers from other realtors in the area.  The primary purpose for a realtor to put one of their listings on a tour such as this is to show the seller they are actively working on promoting the home within the realtor community.  The other reason is for the listing realtor to gain an upper hand in making a change of some sort to the property.  For example, if the home for sale has an ugly green wall and the listing realtor has made a suggestion to repaint the wall and the sellers resist, the listing realtor would ask other realtors on the home tour to say “paint the ugly green wall and the home will show better”.  Another (more common) example would be if the home is over priced.  The listing realtor would put the home on tour and ask other local realtors to write “the home is over priced, needs a price reduction” on their feedback forms.  The listing realtor can then take those forms to the seller and much easier present their case for painting the ugly green wall or make a much needed price reduction.",
      "results": "Number 1, you will be seeing a lot of homes in your local area and also staying in touch with what the current market is doing.  Number 2, you will be meeting other realtors in your community and establishing relationships with colleagues that will help you in the future in putting deals together and creating smoother negotiations in future transactions.  Number 3, you will be doing a favor for a realtor in your office by putting their home on tour.  Very few agents enjoy “realtor home tours”.  They see them as a waste of time.  However, they are necessary in working with some sellers.  Doing a favor for an agent in your office will give you an opportunity to ask them for referrals on leads they may be too busy to work."
    },
    {
      "title": "Day 24",
      "what": "Tell the truth!  I know, this really goes without saying however, I’ve seen many new agents dig large holes for themselves by not being honest with clients and other practitioners.",
      "why": "Again, the answer is obvious!  You are going to be asked a variety of questions from buyers and sellers and you’re just simply not going to know the answer to them.  Buyers and sellers are counting on you and your (unfortunately for now) lack of expertise to represent them and either get them the best deal or make them the most money.  When you’re asked a question you don’t know the answer to, tell them “I don’t know the answer to that question however, I’ll find out for you and get back to you as quickly as I can with the answer”.",
      "results": "Respect from your clients and colleagues.  Let’s face it, if you lie to someone about anything, they will never trust you again, never work with you again, and I’m 100% confident they will never refer you to their friends or family.  Honesty and integrity is the cornerstone of any relationship.  Maintain the trust and confidence that people will expect from you and you will have a client, friend, and a referral source for life!"
    },
    {
      "title": "Day 25",
      "what": "Read your local purchase contract over and over.  Jot down 10-15 questions you’re going to have about the contract and how it works.  Schedule an appointment with your office manager, broker, team member, or a colleague that can help answer your questions.  Continue reading the purchase contract until you know and understand how it works.",
      "why": "Learning the purchase contract inside and out will help you to answer just about any question a buyer or seller will have for you.  You’ve most likely taken at least one contract writing class that is probably a requirement of your local real estate board or required by the state although, nothing will prepare you for “Real” real estate than knowing the purchase contract through and through.",
      "results": "A true understanding of the purchase contract will make your transactions smoother with other practitioners.  It will also help you provide a clear understanding of the buying and selling process for your clients.  "
    },
    {
      "title": "Day 26",
      "what": "Tell yourself everyday that you are going to be a success in this business.  Fully commit yourself to this plan and continue building upon the foundation I’m helping you lay down.",
      "why": "Nobody will believe in you if you don’t believe in yourself and show that confidence in your conversations and actions each day.  Real Estate is an up and down business.  When you are constantly reminding yourself that you will be a success, you will be.",
      "results": "Confidence.  Buyers and sellers will see through you easily and you want to be transparent to them.  They will know you are inexperienced and haven’t sold many homes.  Who cares?  They will still work with you if you are confident in yourself, tell them the truth and “truly” believe you are the best person to be working with them!"
    },
    {
      "title": "Day 27",
      "what": "Plan your next day the evening before.  Create a “to do list”.  Write down tasks, events, errands, and goals you have for the following day.  I’ve created this list for you precisely for the reason of providing you with something “productive” to do each day.  After 30 days, you will be on your own.  Add tasks to my list each day to make sure you stay accountable to yourself and keep yourself busy.",
      "why": "Having a plan each day will keep you busy and allow you to stay in “Realtor mode”.  It’s easy to say “I don’t have anything to do”.  The truth is “there is always something to do when you own and operate your own business”!",
      "results": "Accomplishment!  When you’re consistently accomplishing tasks and obtaining the small goals you set for yourself each day, your confidence will start growing your business for you.  It feels good to achieve goals no matter how large or small they are.  Making a plan each day will help you to organize your business and allow you to prioritize and maximize every hour of the work day!"
    },
    {
      "title": "Day 28",
      "what": "Create your first real estate newsletter that can be printed and mailed to your sphere of influence.  Ask other realtors in your office if you can use some of their marketing materials.  Look through other successful realtor’s websites for topics to write about.  Your local association and MLS typically produce monthly sales statistics for your area.  Use some of this information to create a one or two page newsletter and start branding yourself with your sphere of influence.  You can also place free ads for the small business owners you’ve been meeting and make sure they receive a copy of your newsletter.",
      "why": "Now is your chance to identify yourself as an industry expert.  You’re not trying to recreate anything new or come up with any ground breaking real estate solutions for customers.  You’re goal with this is to simply create a professional image and brand for your business and also try to generate business for some of the small business owners you advertise for.  They will appreciate seeing their business being advertised and they will be more apt to refer you when they know you are trying to refer their business or service.",
      "results": "Creating a professional image for your brand is important.  Putting a newsletter together 3 or 4 times a year will consistently show the people who are receiving it how dedicated you are to your new profession.  The information you provide will become more and more useful to the people who read it.  After you mail, email, and/or post your newsletter to your sphere of influence, wait a few days and call everyone you send it to.  Ask them what they thought of it and if they know of anyone else who would like to receive a copy."
    },
    {
      "title": "Day 29",
      "what": "Create your first flier/post card/personal brochure to send out to your “Farm” subdivision.  You can obtain address labels from the marketing rep at your local title company for free.  Contact them before you do this and pick their brain for additional advice about farming a community.  This is the neighborhood you have been researching and learning about for the last several days.  This action will be a 12 month commitment.  For the first three months you will mail out a post card or some sort of flier to the community.  On the third month, knock on every single door in the community and introduce yourself to the neighbors!  This will be tough for you however, it’s necessary and after a few really good conversations with homeowners, your confidence will go through the roof!  Quickly forget the homeowners that don’t give you the time of day.  Thank them for answering the door and leave a personal flier with them.",
      "why": "Creating a “Farm” neighborhood will bring years of phone calls, appointments, and consistent sales to your business if you are able to identify yourself as the “neighborhood specialist”.",
      "results": "Unfortunately, nothing right away.  Planting seeds and watering them for several months is the way to embed yourself in a community.  Work this subdivision by making contact with homeowners for at least 12 months in a row without giving up on it.  Expect to do something (post card, mailing of some sort, knock on doors, organize a community charity drive for the neighborhood, meet with the leader of the local block watch and offer to assist them with something, etc.) at least once a month."
    },
    {
      "title": "Day 30",
      "what": "Seek out a mentor.",
      "why": "By completing every item on this list, you have laid the foundation for a successful business that will continue producing for you year after year.   I’m confident you have already landed your first client or have several leads you’re working with.  The first few months in this business are difficult.  You’ll feel like you are doing a bunch of work without producing a lot of results.  A veteran /seasoned agent can assist you with your first few transactions and also help you set realistic goals for your first year.  They will also be able to help you through your first few transactions.",
      "results": "You’ll most likely need to split a portion of your commission with any mentor you hire or ask to help you.  It’s worth every penny.  Experience is worth its weight in gold and having a mentor that cares about you and wants to see you succeed is worth a portion of the first few commissions you earn.  Expect a mentor to help you understand the steps of a purchase and a sale (timelines, earnest money, down payment requirements, inspections periods, home warranties, closing costs, contracts, negotiations, listing presentations, etc.).  Having a mentor will also give you confidence when you’re speaking with consumers.  You can tell your clients and customers you are new to the business however, you’re working side by side with a professional that has been in the business for several years and closes 30-40 homes a year."
    }
  ]
}
